In [328]:
import os
import pandas as pd
import numpy as np

In [329]:
seongdong = pd.read_csv("C:/Users/gherwt/KDT30/p1/seongdong_res_cnt.csv", encoding = "cp949")
cctv = pd.read_csv("C:/Users/gherwt/KDT30/p1/cctv_cnt.csv")
school = pd.read_csv("C:/Users/gherwt/KDT30/p1/school_distance.csv")
sub = pd.read_csv("C:/Users/gherwt/KDT30/sub_distance_final.csv")

In [330]:
# 각 데이터를 확인
seongdong.head(2)

     date  build_year   dong    jibun  floor  use_area  res_cnt  total_deposit
0  201501        1986  하왕십리동  890-401      3     39.70       36          15000
1  201501        2012  하왕십리동  890-114      4     13.97       36           8714

In [331]:
cctv.head(2)

    dong  cctv_cnt
0  금호동1가       118
1  금호동2가        95

In [332]:
school.head(2)

   Unnamed: 0    법정동   dong_lat   dong_long  school_dis
0           0  금호동1가  37.554697  127.023412    0.157064
1           1  금호동2가  37.552482  127.020133    0.192920

In [333]:
# school 의 동 명을 맞춰준다.
school = school[['법정동', 'school_dis']]

In [334]:
school = school.rename(columns={'법정동': 'dong'})

In [335]:
sub.head(2)

,address,dong,jibun,lat,long,가까운역,가까운역과의 거리
0,서울특별시 성동구 하왕십리동 890-401,하왕십리동,890-401,37.563604,127.028501,상왕십리역[2호선],0.106753
1,서울특별시 성동구 하왕십리동 890-114,하왕십리동,890-114,37.563288,127.028096,상왕십리역[2호선],0.153176

In [336]:
# sub에서 변수명을 바꿔준다.
sub = sub.rename(columns={'가까운역과의 거리': 'sub_dis'})

In [337]:
# 데이터 합치기
df = pd.merge(seongdong, cctv, on = 'dong', how = 'left')

In [338]:
df = pd.merge(df, school, on = 'dong', how = 'left')

In [339]:
df = pd.concat([df, sub['sub_dis']], axis =1)

In [340]:
df = df[['date', 'build_year', 'dong', 'floor', 'use_area', 'res_cnt', 'cctv_cnt', 'school_dis','sub_dis', 'total_deposit']]

In [341]:
df.head(2)

,date,build_year,dong,floor,use_area,res_cnt,cctv_cnt,school_dis,sub_dis,total_deposit
0,201501,1986,하왕십리동,3,39.70,36,268,0.104621,0.106753,15000
1,201501,2012,하왕십리동,4,13.97,36,268,0.104621,0.153176,8714

In [342]:
df.to_csv('C:/Users/gherwt/KDT30/p1/seongdong_df_total.csv', index = False)

In [343]:
df.describe()

,date,build_year,floor,use_area,res_cnt,cctv_cnt,school_dis,sub_dis,total_deposit
count,12211.000000,12211.000000,12211.000000,12211.000000,12211.000000,12211.000000,12211.000000,12211.000000,12211.000000
mean,201893.886414,2004.259766,2.990418,41.025100,263.790025,369.519777,0.244409,0.421775,18474.840799
std,232.801130,11.576969,1.738373,21.372606,233.127523,180.143763,0.134841,0.210283,9541.313867
min,201501.000000,1970.000000,-2.000000,1.000000,15.000000,19.000000,0.038938,0.041580,1000.000000
25%,201704.000000,1995.000000,2.000000,26.670000,64.000000,171.000000,0.146234,0.272563,12800.000000
50%,201906.000000,2006.000000,3.000000,37.060000,168.000000,403.000000,0.200793,0.369299,17500.000000
75%,202107.000000,2014.000000,4.000000,54.510000,431.000000,504.000000,0.342383,0.538432,23000.000000
max,202212.000000,2022.000000,17.000000,221.090000,958.000000,590.000000,0.524474,1.043076,395000.000000